{"data_type":"CVE","data_format":"MITRE","data_version":"4.0","generator":{"engine":"Vulnogram 0.0.9"},"CVE_data_meta":{"ID":"PAN-SA-2020-0008","ASSIGNER":"psirt@paloaltonetworks.com","DATE_PUBLIC":"2020-08-12T16:00:00.000Z","TITLE":"Informational: BootHole Vulnerability Impact on Palo Alto Networks PAN-OS Software","AKA":"","STATE":"READY"},"source":{"defect":[],"advisory":"","discovery":"EXTERNAL"},"affects":{"vendor":{"vendor_data":[{"vendor_name":"Palo Alto Networks","product":{"product_data":[{"product_name":"PAN-OS","version":{"version_data":[{"version_name":"","version_affected":"!","version_value":"all","platform":""}]}}]}}]}},"problemtype":{"problemtype_data":[{"description":[{"lang":"eng","value":"CWE-120 Buffer Overflow"}]}]},"description":{"description_data":[{"lang":"eng","value":"Palo Alto Networks is aware of the vulnerability known as BootHole (CVE-2020-10713) that affects the Grand Unified Bootloader (GRUB) used in Palo Alto Networks PAN-OS software.\n\nBootHole is a buffer overflow vulnerability that occurs in GRUB2 when parsing an attacker-controlled grub.cfg file. This vulnerability enables arbitrary code execution within the boot environment, which allows persistent control of the system.\n\nIt is not possible for malicious actors or PAN-OS administrators to exploit this vulnerability under normal conditions. Administrators do not have access to the grub configuration file nor do they have permission to modify it. An attacker would need to first compromise the system and then get the root Linux privileges necessary to perform these actions before they could exploit this vulnerability. The BootHole vulnerability itself does not allow an attacker to compromise PAN-OS software.\n\nPalo Alto Networks is not aware of any malicious exploitation of this vulnerability.\n\nThe Palo Alto Networks Product Security Assurance team evaluated this potential vulnerability and determined that the scenarios required for successful exploitation of the BootHole vulnerability do not exist on PAN-OS software under normal conditions.\n"}]},"references":{"reference_data":[{"refsource":"CONFIRM","url":"https://security.paloaltonetworks.com/PAN-SA-2020-0008","name":""},{"refsource":"CONFIRM","url":"https://eclypsium.com/2020/07/29/theres-a-hole-in-the-boot/","name":""}]},"configuration":[{"lang":"eng","value":"This vulnerability is exploitable only when an attacker already compromised the PAN-OS software and gained root Linux privileges on the system. This is not possible under normal conditions."}],"impact":{"cvss":{"version":"3.1","attackVector":"LOCAL","attackComplexity":"HIGH","privilegesRequired":"HIGH","userInteraction":"NONE","scope":"UNCHANGED","confidentialityImpact":"NONE","integrityImpact":"NONE","availabilityImpact":"NONE","vectorString":"CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:N/A:N","baseScore":0,"baseSeverity":"NONE"}},"exploit":[],"work_around":[{"lang":"eng","value":"This vulnerability requires an attacker to compromise PAN-OS software before they can successfully exploit it. The risk of exploitation on PAN-OS software is reduced by upgrading your appliances to the latest versions.\n\nThis issue impacts the PAN-OS management interface but you can additionally mitigate the impact of this issue by following best practices for securing the PAN-OS management interface. Please review the Best Practices for Securing Administrative Access on the PAN-OS technical documentation website at https://docs.paloaltonetworks.com/best-practices."}],"solution":[{"lang":"eng","value":"Palo Alto Networks is working on a fix for the BootHole vulnerability that will prevent an attacker with root privileges from being able to exploit it. The workarounds provided can help mitigate the risk of this issue until that fix is released. There are currently no PAN-OS updates available for this issue."}],"credit":[],"timeline":[{"time":"2020-08-12T16:00:00.000Z","lang":"eng","value":"Initial publication"}]}